// จงเขียนโปรแกรมรับตัวเลข 1 ตัวแล้วให้คอมพิวเตอร์วาดรูป
// เครื่องหมาย * เป็นสี่เหลี่ยมที่มีด้านเท่ากับตัวเลขที่รับเข้ามาโดยมี
// พื้นที่เป็นตารางหมากรุก ดังตัวอย่าง (Level 2)

#include <stdio.h>

int main () {
    int input;
    int i, j;
    scanf("%d", &input);

    for(i = 1; i <= input; i++) {
        for(j = 1; j <= input; j++) {
            if(j % 2 == 0) {
                printf ("*");
            }
            else {
                printf(" ");
            }
        }
        printf("\n");
    }
}